src/test/resources/api_fixtures/invoice_with_discount_ids.json

{
  "account_country": "US",
  "account_name": null,
  "amount_due": 0,
  "amount_paid": 0,
  "amount_remaining": 0,
  "application_fee_amount": null,
  "attempt_count": 0,
  "attempted": false,
  "auto_advance": true,
  "billing_reason": "manual",
  "charge": null,
  "collection_method": "charge_automatically",
  "created": 1234567890,
  "currency": "usd",
  "custom_fields": null,
  "customer": "cus_Hj56dFLtzm170b",
  "customer_address": null,
  "customer_email": null,
  "customer_name": null,
  "customer_phone": null,
  "customer_shipping": null,
  "customer_tax_exempt": "none",
  "customer_tax_ids": [],
  "default_payment_method": null,
  "default_source": null,
  "default_tax_rates": [],
  "description": null,
  "discount": null,
  "discounts": [
    "25_5OFF",
    "50_5OFF"
  ],
  "due_date": 1234567890,
  "ending_balance": null,
  "footer": null,
  "hosted_invoice_url": null,
  "id": "ii_123",
  "invoice_pdf": null,
  "lines": {
    "data": [
      {
        "amount": 1000,
        "currency": "usd",
        "description": "My First Invoice Item (created for API docs)",
        "discountable": true,
        "id": "il_tmp1HA04QCoV8jlnousNLMJApn9",
        "invoice_item": "ii_1HA04QCoV8jlnousNLMJApn9",
        "livemode": false,
        "metadata": {},
        "object": "line_item",
        "period": {
          "end": 1595970646,
          "start": 1595970646
        },
        "plan": null,
        "price": null,
        "proration": false,
        "quantity": 1,
        "subscription": null,
        "tax_amounts": [],
        "tax_rates": [],
        "type": "invoiceitem"
      }
    ],
    "has_more": false,
    "object": "list",
    "url": "/v1/invoices/ii_123/lines"
  },
  "livemode": false,
  "metadata": {},
  "next_payment_attempt": 1234567890,
  "number": null,
  "object": "invoice",
  "paid": false,
  "payment_intent": null,
  "period_end": 1234567890,
  "period_start": 1234567890,
  "post_payment_credit_notes_amount": 0,
  "pre_payment_credit_notes_amount": 0,
  "receipt_number": null,
  "starting_balance": 0,
  "statement_descriptor": null,
  "status": "draft",
  "status_transitions": {
    "finalized_at": null,
    "marked_uncollectible_at": null,
    "paid_at": null,
    "voided_at": null
  },
  "subscription": null,
  "subtotal": 0,
  "tax": null,
  "tax_percent": null,
  "total": 0,
  "total_tax_amounts": [],
  "transfer_data": null,
  "webhooks_delivered_at": 1234567890
}
